[
  {
    "title": "Computer Vision",
    "subtitle": "Real-time Vehicle Classification on Phnom Penh Road in Video Surveillance",
    "author": "Beanbonyka Rim, Sovila Srun , Arnold Williem and Brian C. Lovel",
    "content": "In this work we tackle traffic analysis problems for Phnom Penh roads. Unlike in most developed countries such as Australia and USA, the traffic conditions in developing countries such as Cambodia pose unique challenges. For instance, motorcycles are popular vehicles. This means, during peak hours, where the traffic for cars is congested, the traffic for motorcycles could still be flowing. Thus, any approaches using the whole video to determine the traffic condition are not suitable. To that end, this work provides the first stepping-stone by addressing the Phnom Penh vehicle classification problem. We propose a novel dataset capturing CCTV of Phnom Penh roads in 5 locations from 7am until 5pm in five sunny days. Then, we perform the study by proposing a baseline method comprising three steps: (1) background subtraction; (2) bag-ofword histogram feature extraction; and (3)classification using Support Vector Machine (SVM). Evaluation results show promising results with accuracy 0.76, 0.63 and 0.40 for light, medium and heavy traffic."
  },


  {
    "title": "Simulation",
      "researchs":[
        {
    "subtitle": "A New Model for Simulating and Evaluating Congestion Cause at Signalized Intersection",
    "author": "KimAng Kheang, Sokchea Kor, and Sovila Srun",
    "content": "This paper presents a simulation framework to determine congestion cause for an isolated signalized intersection having four-approaches with through and left-right turn movement under homogenous condition. The simulation framework consists of various correlated models such as vehicles’ path model, car following model, vehicles’ arrival model, and evaluation model. The framework is then implemented to create SPSV (Special Purpose Simulation and Visualization) software. These models are presented in mathematical terms with specified parameters and objective function that later are interrupted and discretized using Object-oriented methodology with programming language. The vehicles’ path model is a piecewise function describing a driver’s position when approaching intersection till leaving intersection in terms of time. The vehicle arrival model is based on negative exponential distribution. The data generated by the models will be used to evaluate the traffic performance on the specified scenario. The parameters input to the models will be used to suggest the optimal setting to determine the factors for better intersection performance."
        },
  
        {
    
    "subtitle": "Road Intersection Simulation and Visualization",
    "author": "KimAng Kheang, Sokchea Kor, and Sovila Srun",
    "content": "This is a special purpose simulation software aiming at analyzing traffic data at the signalized intersection. The input parameters ranged from vehicles’ birth rate, flow distribution, traffic light duration. The traffic mode can also be switched to unrestricted flow (no traffic light presented). The output data are traffic flow, road density, numbers of vehicles, headway, mostly importantly the congestion rate based on current configuration. The simulated data can be used as a reflection for optimization of traffic system to get better traffic performance. 16 visualization panels display corresponding real-time traffic data of each intersection approach."
        }
      ]
  },
  {
    "title": "3D Modeling",
    "subtitle": "Gastromod: An interactive tool for 3D Gastropod Modeling",
    "author": "Sokchea Kor and Susanne Krömker",
    "content": "This paper presents an interactive tool called Gastromod that allows the user to graphically approximate a number of diverse three dimensional ideal shapes of gastropods (snails with shells) developing isometric growth. The implementation uses (i) Raup’s geometric model for constructing the spiral shape and (ii) the Frenet frame to orient generating curves such as circles or ellipses along the spiral curve. The ideal 3D surface of the shell of a gastropod or cephalopod (ammonite) is generated using typical parameters frequently measured in paleontology. In combination with 3D scans of fossils, this tool makes a contribution to assist paleontologists and other related researchers in the analysis of evolution and growth, the study of the possible shell forms and the revolution determination of gastropods."
  },
  {
    "title": "Artificial intelligence",
    "research":[
  {
    
    "subtitle": "Distributed Multi-Agent Model for Air Traffic Flow Management Simulation",
    "author": "Kimang Kheang, Sokchea Kor, Sovila Srun",
    "content": "This paper presents distributed multi-agent models for simulating air traffic control at the airport. The models consist of various autonomous entities (agents) to delegate humans’ activities in controlling and communicating within the airport. Those agents are station agent, aircraft agent, and agent interface. Set of protocols will be introduced as the mean of communication between agents. Each agent will delegate human’s tasks by negotiating over its domain to propose or to demand proposal with other agents. UML (Unified Modelling Language) will be used to model each entity providing hierarchal structure and data flow for better approach to the problem. The agent will be described in term of agent-oriented modelling to elaborate agent behavior."
  },
  {
    
    "subtitle": "Deep Learning: Self Driving Car in Simulation",
    "author": "Sopheak Samreth, Sevheng Luy, Virak Duong, Sovilla Srun",
    "content": "We want to build an agent that can learn how to drive cars by itself in a simulator. We will use Behavioral Cloning and Lane Detection to achieve this. Using our knowledge on Deep Neural Networks and Convolutional Neural Networks (CNN), our task is to train the agent to drive and then let it learn how to drive with the given data i.e. cloning driving behavior. That means it is equipped with information regarding driving beforehand and then it will try to learn new driving information in future simulation by itself. This is the latest topic in AI that attracts a lot of attention in recent researches. With this project, we may contribute to the future of self-driving cars where human errors can be eliminated which will lead to improvement of road safety."
  }
    ]
  }
]
